dreplogle/EE-345M/boards/ek-lm3s8962/drivers/OS.c
  //Initialize a TCNT-like countdown timer on timer 1
 
  // Enable Timer1 module
  SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER1);

  // Configure Timer1 as a 32-bit periodic timer.
  TimerConfigure(TIMER1_BASE, TIMER_CFG_32_BIT_PER);
  TimerLoadSet(TIMER1_BASE, TIMER_A, MAX_TCNT);

  // Start Timer1.
  TimerEnable(TIMER1_BASE, TIMER_A);

  // For profiling the time interrupts are disabled.
  TimeIbitDisabled = 0;

  //Initialize the OSThreads array to empty
  for(threadNum = 0; threadNum < MAX_NUM_OS_THREADS; threadNum++)
  {
    OSThreads[threadNum].id = DEAD;  
  }
  CurrentThread = NULL;	
  ThreadList = NULL;

  OS_DebugProfileInit();
  // Initialize oLED display
  RIT128x96x4Init(1000000);
  // Initialize ADC
  ADC_Open();
  // Initialize serial communication
  OSuart_Open();

  // For periodic threads
  OS_InitSemaphore(&PeriodicTimerMutex, 1);
  TimerAFree = 1;
  TimerBFree = 1;
  firstJitterA = 1;
  firstJitterB = 1;
} 


//***********************************************************************
//
// OS_AddThread	initializes a TCB in the global TCB array and places the
// new TCB at the end of a circular linked list.
//
// \param task is the program associated with the thread
// \param stackSize is the size of the thread's stack in bytes
// \param id is a numerical identifier for the TCB
//
// \return SUCCESS if there was room for the thread, FAIL otherwise.
//
//***********************************************************************
int
OS_AddThread(void(*task)(void), unsigned long stackSize, unsigned long priority)
{
  int threadNum;
  int addNum = 0;
  TCB * searchPtr;
  int addSuccess = FAIL;

  //Enter critical
  long sr = 0;
  unsigned long timeIoff;
  OS_ENTERCRITICAL();
  
  //
  // Look for the lowest avaliable slot in the OSThread list, if there is no spot,
  // return with error code.  If there is a spot, initialize it with the given
  // parameters.
  //
  for(threadNum = MAX_NUM_OS_THREADS-1; threadNum >= 0; threadNum--)
  {
    if(OSThreads[threadNum].id == DEAD)  //Indicates corresponding thread is inactive
    {
      addNum = threadNum;
	  addSuccess = SUCCESS;
    }
  }

  if(addSuccess == SUCCESS)
  {
    //
    // Initialize the stack pointer for the TCB with the bottom of the 
    // stack.
    //
    OSThreads[addNum].stackPtr = &ThreadStacks[addNum][STACK_SIZE-1];
    //
    // Load initial values onto the stack
    //
	OSThreads[addNum].stackPtr = StackInit(OSThreads[addNum].stackPtr, task);

	OSThreads[addNum].id = addNum+1;
	OSThreads[addNum].priority = priority;
	OSThreads[addNum].sleepCount = 0;
	OSThreads[addNum].BlockPt = NULL;
  }	   
  
  //
  // Add the new thread to the circular linked list of threads
  //
  if(ThreadList == NULL) // List is empty, this is the first thread
  {
    // Current thread is the start of the list
	ThreadList = &OSThreads[addNum];
	
	// Thread points back to the beginning of the list  
	OSThreads[addNum].next = ThreadList; 

  }
  else
  {
    searchPtr = (*ThreadList).next;

	// Sets searchPtr to the end element on the list
	// Find where the list wraps around  
	while((*searchPtr).next != ThreadList)
	{
	  searchPtr = (*searchPtr).next;
	}

	// Add the new TCB to the end of the list
	searchPtr->next = &OSThreads[addNum];

	// Advance to the current element
	searchPtr = (*searchPtr).next;

	// Set the next pointer of the new TCB to the beginning of the list
	(*searchPtr).next = ThreadList; 
  }

  //Exit critical
  OS_EXITCRITICAL();

  return addSuccess;

}

//***********************************************************************
//
// OS_AddButtonTask initializes an interrupt to occur on PF1,
// the select switch.
//
// \param task is the function to be executed when the switch is pressed
// \param priority is the priority for the switch interrupt.
//
// \return SUCCESS if priority is within valid limits, FAIL otherwise.
//
//***********************************************************************
int 
OS_AddButtonTask(void(*task)(void), unsigned long priority)
{
  // Assign the task function pointer to the global pointer to be
  // accessed in the ISR.
  ButtonTask = task;
  
  // Enable GPIO PortF module
  SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);

  // Make the switch pin an input
  GPIOPinTypeGPIOInput(GPIO_PORTF_BASE, GPIO_PIN_1);
  GPIOPadConfigSet(GPIO_PORTF_BASE, GPIO_PIN_1, GPIO_STRENGTH_2MA,
                     GPIO_PIN_TYPE_STD_WPU);

  // Enable interrupts associated with the switch
  //GPIOPinIntEnable(GPIO_PORTF_BASE, GPIO_PIN_1);
  
  // Set priority for the button interrupt.
  //if(priority < 8)
  //{
  //	IntPrioritySet(INT_TIMER2A,(unsigned char)priority);
  //}
  //else
  //{
	//  return FAIL; 
  //}
  //GPIOPinIntClear(GPIO_PORTF_BASE, GPIO_PIN_1);
  //IntEnable(INT_GPIOF); 
  //IntEnable(INT_TIMER2A);
  return SUCCESS;
}

//***********************************************************************
//
// OS_AddDownTask initializes an interrupt to occur on PE1,
// the down switch.
//
// \param task is the function to be executed when the switch is pressed
// \param priority is the priority for the switch interrupt.
//
// \return SUCCESS if priority is within valid limits, FAIL otherwise.
//
//***********************************************************************
int 
OS_AddDownTask(void(*task)(void), unsigned long priority)
{
  // Assign the task function pointer to the global pointer to be
  // accessed in the ISR.
  DownTask = task;
  
  // Enable GPIO PortE module
  SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);

  // Make the switch pin an input
  GPIOPinTypeGPIOInput(GPIO_PORTE_BASE, GPIO_PIN_1);
  GPIOPadConfigSet(GPIO_PORTE_BASE, GPIO_PIN_1, GPIO_STRENGTH_2MA,
                     GPIO_PIN_TYPE_STD_WPU);

  // Enable interrupts associated with the switch
  //GPIOPinIntEnable(GPIO_PORTE_BASE, GPIO_PIN_1);
  
  // Set priority for the button interrupt.
  if(priority < 8)
  {
  	IntPrioritySet(INT_TIMER2A,(unsigned char)priority);
  }
  else
  {
	  return FAIL; 
  }
  //GPIOPinIntClear(GPIO_PORTE_BASE, GPIO_PIN_1);
  //IntEnable(INT_GPIOE); 
  IntEnable(INT_TIMER2A);

  return SUCCESS;
}

//***********************************************************************
//
// OS_RemoveButtonTask removes the interrupt occuring on PE1,
// the down switch.
//
// \param task is the function to be executed when the switch is pressed
// \param priority is the priority for the switch interrupt.
//
// \return SUCCESS if priority is within valid limits, FAIL otherwise.
//
//***********************************************************************

OS_RemoveButtonTask(void(*task)(void))
{
  // Remove the task pointer associated with the down button
  DownTask = NULL;
  
